Revit 2024 API
ExtElemChangeBeamSectionRegistry.Unregister Method
 Unregisters IExtElemChangeBeamSection.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public static void Unregister()
Visual Basic
Public Shared Sub Unregister
Visual C++
public:
static void Unregister()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  There is no valid Connections Provider registered.
See Also
ExtElemChangeBeamSectionRegistry Class
Autodesk.Revit.DB.Structure Namespace